let KoiSecurity=externaldata(extension_id:string, extension_name:string)
[h'https://raw.githubusercontent.com/SlimKQL/Hunting-Queries-Detection-Rules/refs/heads/main/IOC/KoiSecurity-18MaliciousExtensions.csv']
with (format='csv', ignoreFirstRecord=false);
DeviceFileEvents
| where Timestamp > ago(30d)
| where ActionType == "FileCreated" or ActionType == "FileModified"
| where FileName endswith ".crx"
| extend ExtensionIDVersion = tostring(split(FileName, '.')[0])
| extend ExtensionID = tolower(split(ExtensionIDVersion, '_')[0])
| summarize arg_max(TimeGenerated, *) by DeviceName, ExtensionID
| join KoiSecurity on $left.ExtensionID == $right.extension_id
| project Timestamp, DeviceName, extension_name
